# get list
code --list-extensions > extensions_new.txt

code --install-extension alexdima.copy-relative-path
code --install-extension andyyaldoo.vscode-json
code --install-extension atishay-jain.all-autocomplete
code --install-extension bmewburn.vscode-intelephense-client
code --install-extension christian-kohler.npm-intellisense
code --install-extension christian-kohler.path-intellisense
code --install-extension dbaeumer.vscode-eslint
code --install-extension dcasella.monokai-plusplus
code --install-extension digitalbrainstem.javascript-ejs-support
code --install-extension donjayamanne.githistory
code --install-extension dsznajder.es7-react-js-snippets
code --install-extension ducfilan.pug-formatter
code --install-extension dzannotti.vscode-babel-coloring
code --install-extension ecmel.vscode-html-css
code --install-extension emmanuelbeziat.vscode-great-icons
code --install-extension esbenp.prettier-vscode
code --install-extension ex-codes.pine-script-syntax-highlighter
code --install-extension felixfbecker.php-intellisense
code --install-extension formulahendry.auto-rename-tag
code --install-extension glenn2223.live-sass
code --install-extension hb432.prettier-eslint-typescript
code --install-extension henry-li.vscode-import-formatter
code --install-extension humao.rest-client
code --install-extension jasonnutter.search-node-modules
code --install-extension jawandarajbir.react-vscode-extension-pack
code --install-extension jeremyrajan.react-component
code --install-extension jeylanib.pinescript
code --install-extension kokororin.vscode-phpfmt
code --install-extension leizongmin.node-module-intellisense
code --install-extension lzrnic.javascript-vscode-extension
code --install-extension ms-vscode.powershell
code --install-extension msjsdiag.vscode-react-native
code --install-extension nucllear.vscode-extension-auto-import
code --install-extension octref.vetur
code --install-extension riazxrazor.html-to-jsx
code --install-extension rifi2k.format-html-in-php
code --install-extension ritwickdey.liveserver
code --install-extension sdras.night-owl
code --install-extension sibiraj-s.vscode-scss-formatter
code --install-extension streetsidesoftware.code-spell-checker
code --install-extension wmaurer.html2jade
code --install-extension xabikos.javascriptsnippets
code --install-extension xabikos.reactsnippets
